=== STRUCTURE PROPOSAL ===
{
  "overall_theme": "The transformation of Bruce Wayne into Batman: A journey from trauma and loss to redemption, resilience, and the embrace of justice through personal sacrifice and inner strength.",
  "narrative_logic": "The narrative follows a non-linear but emotionally coherent arc, beginning with the origin of Bruce Wayne’s trauma, tracing his physical and psychological evolution through isolation, training, and moral conflict, culminating in his emergence as Batman. The story emphasizes internal growth—fear transformed into purpose, pain into power—and concludes with a quiet, introspective resolution that underscores his enduring commitment to Gotham.",
  "video_structure": [
    {
      "content": "A young Bruce Wayne explores a dimly lit greenhouse, his curiosity piqued by a strange, glowing stone. He reaches for it, triggering a sudden collapse of the floor. He falls into a dark, echoing well, the camera spiraling downward as he screams. The scene cuts to a nightmare: his parents are shot in a dark alley, the sound of gunshots echoing as he watches helplessly. The image fades to black, leaving only the echo of his mother’s voice.",
      "key_words": "young bruce wayne, greenhouse, falling, nightmare, parents murder",
      "audio_section": "Intro",
      "emotion": "Melancholic, introspective, haunting",
      "start_time": "00:00",
      "end_time": "00:36"
    },
    {
      "content": "Bruce, now a teenager, is shown in a bleak prison cell, bruised and exhausted. He is being interrogated by a shadowy figure. Flashbacks of his parents’ murder flash across his face. He is then dragged into a training chamber, where he is forced to confront his deepest fears—bats, darkness, and the sound of gunshots. He collapses, but rises again, determined. The scene ends with him standing before Ra's al Ghul, who watches him with cold intensity.",
      "key_words": "prison, training, fear, Ra's al Ghul, determination",
      "audio_section": "Verse 1",
      "emotion": "Somber, vulnerable, resilient",
      "start_time": "00:36",
      "end_time": "01:10"
    },
    {
      "content": "A montage of Bruce’s training: he runs through a forest at dawn, climbs sheer cliffs, fights in hand-to-hand combat, and meditates in silence. The camera captures his physical transformation—his body lean and strong, his eyes sharp and focused. The sequence culminates in a dramatic shot of him standing atop a mountain, the wind whipping around him, as the sun rises behind him. The music swells with a powerful cello melody.",
      "key_words": "training montage, physical transformation, discipline, strength, sunrise",
      "audio_section": "Instrumental Bridge",
      "emotion": "Dramatic, powerful, transcendent",
      "start_time": "01:11",
      "end_time": "01:42"
    },
    {
      "content": "Bruce returns to Gotham, now as Batman. He confronts Dr. Crane in a dark, industrial warehouse, the air thick with smoke and the sound of bats. The fight is intense—Batman uses his agility and intellect to outmaneuver Crane, who is fueled by hallucinogenic toxin. The scene ends with Batman standing over Crane, who is screaming in terror as the warehouse erupts in flames. The music reaches a crescendo with the full vocal and instrumental force.",
      "key_words": "Batman, Dr. Crane, fight, warehouse, fire, bats",
      "audio_section": "Chorus",
      "emotion": "Cathartic, triumphant, hopeful",
      "start_time": "01:43",
      "end_time": "02:28"
    },
    {
      "content": "Batman stands on a rooftop, rain falling around him. He watches the city below, his silhouette framed by the glow of neon lights. The camera slowly zooms in on his face, revealing a quiet resolve. He turns and walks away, disappearing into the shadows. The music fades gently, leaving only the sound of rain and a soft piano note.",
      "key_words": "Batman, rooftop, rain, city, solitude, resolve",
      "audio_section": "Outro",
      "emotion": "Peaceful, reflective, somber",
      "start_time": "02:29",
      "end_time": "02:58"
    }
  ]
}

